Documents/бит_ВводСуммПоРаспределениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводСуммПоРаспределениям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_Распределения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПоРаспределениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распределение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_РаспределенияНаУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_РаспределенияНаУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_Распределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_Распределения</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Распределения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_ВводСуммПоРаспределениям/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

//  Процедура выполняет заполнение таблицы показаний.
//
Процедура ЗаполнитьТаблицуПоказаний() Экспорт
						
	ПоказанияПоРаспределениям.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",КонецДня(Дата));
	
	Если Не Дом = Справочники.бит_СписокЗданий.ПустаяСсылка() Тогда    // по дому
		Запрос.УстановитьПараметр("Объект",Дом);
		ТекстУсловия = " Объект = &Объект";
	ИначеЕсли НЕ Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда    // по улице
		Запрос.УстановитьПараметр("Улица",Улица);
		ТекстУсловия = " Объект.Улица = &Улица"
	КонецЕсли;
	
	Если Не Услуга = Справочники.бит_УслугиЖКХ.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("Услуга", Услуга);
		ТекстУсловия = ТекстУсловия + " И Услуга = &Услуга";       
	КонецЕсли;
	// БИТ_ЖКХ изменения кода . 16.12.2011, добавлено в запрос ТекстУсловия
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Объект,
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.Распределение
	|ИЗ
	|	РегистрСведений.бит_РаспределенияНаУслугах.СрезПоследних(&Дата,"+ ТекстУсловия + " ) КАК бит_РаспределенияНаУслугахСрезПоследних
	|ГДЕ
	|	бит_РаспределенияНаУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РаспределенияНаУслугахСрезПоследних.Распределение,
	|	бит_РаспределенияНаУслугахСрезПоследних.Услуга,
	|	бит_РаспределенияНаУслугахСрезПоследних.Объект";
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		НовСтрока = ПоказанияПоРаспределениям.Добавить();
		Если Улица = Справочники.бит_СписокУлиц.ПустаяСсылка() Тогда
			НовСтрока.Улица = Выборка.Объект.Улица;
		КонецЕсли;	
		
		НовСтрока.Дом 			= Выборка.Объект;
		НовСтрока.Распределение = Выборка.Распределение;
		НовСтрока.Услуга 		= Выборка.Услуга;
	КонецЦикла;
						
КонецПроцедуры
				
// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
						
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Улица");	
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
						
КонецПроцедуры // ПроверитьЗаполнениеШапки()
					
					
// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента)
						
	Для каждого Строка Из ПоказанияПоРаспределениям Цикл
		
		Движение = Движения.бит_Распределения.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период				= Дата;
		Движение.Объект 			= ?(ЗначениеЗаполнено(Дом),Дом, Строка.Дом);
		Движение.Услуга 			= Строка.Услуга;
		Движение.Распределение		= Строка.Распределение;
		Движение.Сумма				= Строка.Сумма;
		
		// БИТ_ЖКХ 29.05.2014	
		Движение.Организация   = СтруктураШапкиДокумента.Организация;
		// БИТ_ЖКХ 29.05.2014
		
	КонецЦикла; 
						
КонецПроцедуры
					
#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
					
// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	
	Если НЕ Отказ Тогда
		
		// БИТ_ЖКХ 23.05.2014
		// ДвиженияПоРегистрам();
		ДвиженияПоРегистрам(СтруктураШапкиДокумента);
		// БИТ_ЖКХ 23.05.2014
		
	КонецЕсли;
	
КонецПроцедуры
					
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	Ответственный      = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
